# Data Cleansing/ Data Processing / Data Wrangling / Data scrubbing
- Import the necessary libraries 
- Load the data
- Handling the Missing Values
- Encoding the Categorical Variables
- Splitting the Dataset into Training set and Test test
- Feature Scaling

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import sklearn

In [9]:
### import the dataset
data =pd.read_table("http://bit.ly/movieusers")# in read_csv the sep is ,. the data set is in a porper structure which isa cow cloumn format
data.head(2)

  1|24|M|technician|85711
0      2|53|F|other|94043
1     3|23|M|writer|32067

In [8]:
data =pd.read_table("http://bit.ly/movieusers",sep='|')# in read_table the sep is |.
data.head(2)

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [12]:
data =pd.read_table("http://bit.ly/movieusers",sep='|',header=None)
data.head(2)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

# Handling the missing values

In [55]:
df=pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [19]:
df.day.dtype

dtype('O')

In [20]:
type(df.day[0])

str

In [56]:
df=pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates=["day"])
df
# parse_dates[] converts the pervious string data type to datype

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [33]:
df.day.dtype

dtype('<M8[ns]')

In [34]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [ ]:
# convert the date from string to object

In [16]:
df["temperature"]# to access a column

0       32
1   -99999
2       28
3   -99999
4       32
5       31
6       34
Name: temperature, dtype: int64

In [27]:
# returns the frequency
df["temperature"].value_counts() #mode

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [29]:
df["event"].value_counts()

0        2
Sunny    2
Rain     2
Snow     1
Name: event, dtype: int64

In [21]:
# checking for the entire data set
df[df.duplicated()]
# as there is no duplicate od the rows nothing except the heading is printed

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [22]:
# for checking duplicates for the specified data set
df[df["temperature"].duplicated()]# on check for the column

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [23]:
df[df["event"].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [83]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [102]:
# replacing the -99999 with Nan and replacing 0 to Nan. 
# 0 and missing values ar different, Nan is not a number
new_df=df.replace({"temperature":-99999,"windspeed":-99999,"event": '0'},np.nan)
# passes 2 argumants one is the old and the other is the new
# we have Nan in np.nan
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

## Imputations: Imputation in a process of substituting or replacing the msssing values

In [40]:
# TO FIND THE NUMBER OF MISSING VALUES IN THE COLUMNS
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [75]:
# fillna() is used to fill the missinbg values
df1=new_df.fillna(0)# Shift+tab 4 times for full documentations
df1

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [77]:
# fills the nan value from the previous row
f_data=new_df.fillna(method="ffill")
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [81]:
## bfill-- back fill 
b_data=new_df.fillna(method="bfill")
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [82]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [86]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [85]:
# Mean imputation:-
# replace the nan values with the mean of the corresponding column
mean_data=new_df.fillna(new_df.mean())
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [89]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [88]:
# Median imputatuion
median_data=new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [90]:
new_df.event.mode().iloc[0]

0     Rain
1    Sunny
dtype: object

In [97]:
# when we have calegorical data we use model
new_df["event"]=new_df["event"].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

In [103]:
new_df.event.mode().iloc[1]

'Sunny'

In [104]:
# when we have calegorical data we use model
new_df["event"]=new_df["event"].fillna(new_df.event.mode().iloc[1])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0  Sunny
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny